	IDENTIFICATION DIVISION.
	PROGRAM-ID. CONDITIONS.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 CHECK-GENDER.
		05 GENDER PIC X(1).
			88 MALE VALUE 'M'.
			88 FEMALE VALUE 'F'.
			88 UNIDENTIFIED VALUE 'U'.
		
	PROCEDURE DIVISION.
	MAIN-PARA.
		SET MALE TO TRUE.
		IF MALE
			DISPLAY "C'est un homme"
		ELSE
			DISPLAY "C'est une femme"
		END-IF.

	STOP RUN.