	IDENTIFICATION DIVISION.
	PROGRAM-ID. EVALUATE.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 CHECK-GENDER.
		05 GENDER PIC X(1).
			88 MALE VALUE 'M'.
			88 FEMALE VALUE 'F'.
			88 UNIDENTIFIED VALUE 'U'.
	77 A PIC 9(1).
	77 B PIC 9(1).
	77 AGE PIC 9(2).
		
	PROCEDURE DIVISION.
	MAIN-PARA.
		DISPLAY "EVALUATE avec une seule condition"
		SET MALE TO TRUE.
		EVALUATE GENDER
			WHEN 'M'
				DISPLAY "C'est un homme"
			WHEN 'F'
				DISPLAY "C'est une femme"
			WHEN OTHER
				DISPLAY "On sait pas"
		END-EVALUATE.
		
		DISPLAY ""
		DISPLAY "EVALUATE avec 2 Conditions"
		MOVE 2 TO A.
		MOVE 5 TO B.
		EVALUATE A ALSO B
			WHEN 1 ALSO 5
				DISPLAY "Resultat 1"
			WHEN 2 ALSO 5
				DISPLAY "Resultat 2"
			WHEN 3 ALSO 5
				DISPLAY "Resultat 3"
			WHEN OTHER
				DISPLAY "Aucun resultat"
		END-EVALUATE.
		
		DISPLAY ""
		DISPLAY "EVALUATE avec intervalles"
		MOVE 25 TO AGE.
		EVALUATE AGE
			WHEN 0 THRU 9
				DISPLAY "Bébé"
			WHEN 10 THRU 19
				DISPLAY "Ado"
			WHEN 20 THRU 49
				DISPLAY "Adulte"
			WHEN 50 THRU 99
				DISPLAY "Vieux"
			WHEN OTHER
				DISPLAY "Chaud"
		END-EVALUATE.
	STOP RUN.