	IDENTIFICATION DIVISION.
	PROGRAM-ID. ARRAYS.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 TAB-WEEK.
		05 DAY-NAME OCCURS 7 TIMES PIC X(9) .	
	77 idx PIC 9(2).
	
	PROCEDURE DIVISION.
		MOVE "Lundi" TO DAY-NAME(1).
		MOVE "Mardi" TO DAY-NAME(2).
		MOVE "Mercredi" TO DAY-NAME(3).
		MOVE "Jeudi" TO DAY-NAME(4).
		MOVE "Vendredi" TO DAY-NAME(5).
		MOVE "Samedi" TO DAY-NAME(6).
		MOVE "Dimanche" TO DAY-NAME(7).
		
		DISPLAY "Affichage des jours".
		PERFORM VARYING idx FROM 1 BY 1 UNTIL idx > 7
			DISPLAY DAY-NAME(idx)
		END-PERFORM.
	STOP RUN.