	IDENTIFICATION DIVISION.
	PROGRAM-ID. INSPECT.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 I-STRING PIC A(30).
	01 COUNTER PIC 9(2).
	
	PROCEDURE DIVISION.
		MOVE "I.AM  UNSTRING-EXAMPLE" TO I-STRING.
		DISPLAY "Nombre de I dans la phrase : '" I-STRING "'".
		INSPECT I-STRING TALLYING COUNTER FOR ALL "I".
		DISPLAY "Nombre de I : " COUNTER.
		
		DISPLAY "Remplacement du . par un -".
		DISPLAY "Phrase avant : " I-STRING.
		INSPECT I-STRING REPLACING ALL '.' BY '-'.
		DISPLAY "Phrase apres : " I-STRING.
		STOP RUN.