	IDENTIFICATION DIVISION.
	PROGRAM-ID. PERFORM.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	77 idx PIC 9(2).
		
	PROCEDURE DIVISION.
	MAIN-PARA.
		DISPLAY "Boucle for idx de 0 a 10"
		PERFORM VARYING idx FROM 0 BY 1 UNTIL idx > 10
			DISPLAY "Iteration " idx
		END-PERFORM.
		
		DISPLAY ""
		DISPLAY "Do while idx < 10"
		PERFORM TEST AFTER VARYING idx FROM 0 BY 1 UNTIL idx > 10
			DISPLAY "Iteration " idx
		END-PERFORM.
	STOP RUN.