	IDENTIFICATION DIVISION.
	PROGRAM-ID. STRING.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 STR1 PIC X(10) VALUE 'I AM AN /'.
	01 STR2 PIC X(12) VALUE 'EXAMPLE OF '.
	01 STR3 PIC X(26) VALUE 'STRING OPERATION ....'.
	01 F-STRING PIC X(30).
	01 F-POINTER PIC 9(2).
	
	PROCEDURE DIVISION.
		MOVE 1 TO F-POINTER.
		STRING STR1 DELIMITED BY '/'
			   STR2 DELIMITED BY SIZE
			   STR3 DELIMITED BY SPACE
			INTO F-STRING
			   WITH POINTER F-POINTER
			   ON OVERFLOW DISPLAY "OVERFLOW"
			   NOT ON OVERFLOW DISPLAY "NOT OVERFLOW"
		END-STRING.
		DISPLAY "Resultat : " F-STRING.
		DISPLAY "Pointeur : " F-POINTER.
		STOP RUN.