	IDENTIFICATION DIVISION.
	PROGRAM-ID. UNSTRING.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 STR1 PIC A(02).
	01 STR2 PIC A(05).
	01 STR3 PIC A(25).
	
	01 I-STRING PIC A(30).
	
	PROCEDURE DIVISION.
		MOVE "I.AM  UNSTRING-EXAMPLE" TO I-STRING.
		UNSTRING I-STRING DELIMITED BY '.' OR ALL SPACES
			INTO
				STR1
				STR2
				STR3
		END-UNSTRING.
		
		DISPLAY "Chaine 1 : " STR1.
		DISPLAY "Chaine 2 : " STR2.
		DISPLAY "Chaine 3 : " STR3.
		STOP RUN.